// Задача 22. О стрелочных функциях JavaScript:
// // Пример стрелочной функции
const add = (a, b) => a + b;
console.log(add(2, 3)); // Выведет 5
// Вопрос: Что такое стрелочная функция в JavaScript?
// Варианты ответов:
// 1. Стрелочная функция - это метод, который позволяет перемещаться по элементам массива.
// 2. Стрелочная функция - это способ определения функции в JavaScript с использованием стрелочного синтаксиса `=>`.
// 3. Стрелочная функция - это особый тип объекта в JavaScript, предназначенный для хранения и передачи функциональности.
// 4. Стрелочная функция - это ключевое слово в JavaScript, используемое для создания псевдонимов функций.
// Выберите один ответ.