// Задача 32. Быстрое преобразование массива.

let numbers = [4, 8, 15, 16, 23, 42];

let doubledNumbers = numbers.['******'](function(num) {
    return num * 2;
});

console.log(doubledNumbers); // Вывод: [8, 16, 30, 32, 46, 84]
// Какой метод массива был использован в коде - что нужно написать на месте `[******]`?
// 1. forEach()
// 2. filter()
// 3. map()
// 4. reduce()
// Выберите один ответ.
// / можно просто нажать на нужную цифру-эмоджи или в комментариях ответить. Если что-то не понятно - задавайте вопросы в комментариях.