// Задача 17. Какая функция используется в приведенном коде?

(function() {
  console.log("Эта функция вызывается очень интересно!");
})();
// Варианты Ответов:
// 1. Это пример самовызывающейся функции, которые вызываются только после завершения другой функции.
// 2. Это пример функций также известных как «Немедленно вызываемые функциональные выражения» или «Самовызывающиеся анонимные функции». Эти функции вызываются автоматически в коде, поэтому их называют «Самовызывающиеся функции».
// 3. Это пример Immediately Invoked Function Expression функции, которые вызываются только по необходимости в коде, их также называют «Автоматические функции».
// 4. Это пример IIFE функции, которые вызываются только по запросу пользователя.
// Выберите один ответ:
// / можно просто нажать на нужную 