// Homework 05. Course JavaScript.
// Задача.
// Выполняйте пошагово.
// 1. Задайте объект room и его параметры:
// ключ height со значением 3
// ключ tv со значением samsung
// ключ big со значением true
// 2. Выведите в alert или console.log все параметры объекта room по очереди
// 3. Выведите в alert или console.log тип данных параметра big
// 4. Выведите в alert или console.log количество символов в строке параметра tv (длину строки)
// 5. Выведите в alert или console.log результат расчёта: длина строки параметра tv минус 1
// 6. Поменяйте samsung на все заглавные буквы и выведите в alert или консоль лог.
// 7. Замените samsung на LG в нашем объекте room
// 8. 1. Добавьте в наш объект room ещё одну пару ключ-значение: ключ furniture, значение - массив из 3 строк: "table", "chair", "sofa"
// 2. выведите chair в console.log (путем обращения к массиву)
// 9. Удалите из нашего объекта room параметр big
// 10. 1. Задайте переменную paint со значением color
// 2. Создайте объект room и внутри него задайте ключ: в качестве имени ключа возьмите из переменной paint её значение color, в качестве значения присвойте blue
// 3. Выведите в консоль лог ключ и его значение blue
